; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-8-7-31)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	driver8 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p1-3 - location
	p2-5 - location
	p2-6 - location
	p4-1 - location
	p5-4 - location
	p6-0 - location
	p6-2 - location
	p6-5 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s4)
	(at driver3 s1)
	(at driver4 s4)
	(at driver5 s3)
	(at driver6 s3)
	(at driver7 s4)
	(at driver8 s5)
	(at truck1 s4)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at truck7 s1)
	(empty truck7)
	(at package1 s2)
	(at package2 s2)
	(at package3 s0)
	(at package4 s4)
	(at package5 s2)
	(at package6 s6)
	(at package7 s1)
	(at package8 s5)
	(at package9 s2)
	(at package10 s5)
	(at package11 s5)
	(at package12 s4)
	(at package13 s2)
	(at package14 s2)
	(at package15 s1)
	(at package16 s4)
	(at package17 s6)
	(at package18 s4)
	(at package19 s0)
	(at package20 s6)
	(at package21 s3)
	(at package22 s2)
	(at package23 s1)
	(at package24 s0)
	(at package25 s1)
	(at package26 s4)
	(at package27 s4)
	(at package28 s5)
	(at package29 s3)
	(at package30 s3)
	(at package31 s5)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(path s6 p6-0)
	(path p6-0 s6)
	(path s0 p6-0)
	(path p6-0 s0)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(link s0 s1)
	(link s1 s0)
	(link s0 s6)
	(link s6 s0)
	(link s1 s5)
	(link s5 s1)
	(link s2 s4)
	(link s4 s2)
	(link s2 s5)
	(link s5 s2)
	(link s3 s2)
	(link s2 s3)
	(link s3 s5)
	(link s5 s3)
	(link s4 s0)
	(link s0 s4)
	(link s4 s1)
	(link s1 s4)
	(link s5 s4)
	(link s4 s5)
	(link s6 s2)
	(link s2 s6)
	(link s6 s3)
	(link s3 s6)
	(link s6 s4)
	(link s4 s6)
	(link s6 s5)
	(link s5 s6)
)
	(:goal (and
	(at driver2 s1)
	(at driver3 s0)
	(at driver4 s5)
	(at driver7 s0)
	(at driver8 s1)
	(at truck1 s0)
	(at truck2 s3)
	(at truck4 s3)
	(at truck5 s4)
	(at truck6 s2)
	(at package1 s2)
	(at package2 s0)
	(at package3 s5)
	(at package4 s3)
	(at package5 s0)
	(at package6 s4)
	(at package7 s1)
	(at package8 s3)
	(at package9 s1)
	(at package10 s2)
	(at package11 s4)
	(at package12 s0)
	(at package13 s0)
	(at package14 s5)
	(at package15 s1)
	(at package16 s1)
	(at package17 s2)
	(at package18 s1)
	(at package19 s4)
	(at package20 s3)
	(at package22 s6)
	(at package23 s1)
	(at package24 s3)
	(at package25 s5)
	(at package26 s3)
	(at package27 s3)
	(at package28 s0)
	(at package29 s1)
	(at package31 s4)
	))


)

; plan
1. (board-truck driver1 s2 truck5)
   deleted: (at driver1 s2) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 4 of 39
2. (drive-truck driver1 s2 s4 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   goals met: 5 of 39
3. (load-truck s3 package29 truck3)
   deleted: (at package29 s3)
   added: (in package29 truck3)
   goals met: 5 of 39
4. (board-truck driver6 s3 truck3)
   deleted: (at driver6 s3) (empty truck3)
   added: (driving driver6 truck3)
   goals met: 5 of 39
5. (drive-truck driver6 s3 s2 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 5 of 39
6. (load-truck s2 package9 truck3)
   deleted: (at package9 s2)
   added: (in package9 truck3)
   goals met: 5 of 39
7. (drive-truck driver6 s2 s5 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s5)
   goals met: 5 of 39
8. (load-truck s5 package8 truck3)
   deleted: (at package8 s5)
   added: (in package8 truck3)
   goals met: 5 of 39
9. (load-truck s5 package31 truck3)
   deleted: (at package31 s5)
   added: (in package31 truck3)
   goals met: 5 of 39
10. (load-truck s5 package28 truck3)
   deleted: (at package28 s5)
   added: (in package28 truck3)
   goals met: 5 of 39
11. (drive-truck driver6 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 5 of 39
12. (drive-truck driver6 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 5 of 39
13. (load-truck s0 package3 truck3)
   deleted: (at package3 s0)
   added: (in package3 truck3)
   goals met: 5 of 39
14. (drive-truck driver6 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 5 of 39
15. (unload-truck s1 package9 truck3)
   deleted: (in package9 truck3)
   added: (at package9 s1)
   goals met: 6 of 39
16. (drive-truck driver6 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 6 of 39
17. (drive-truck driver6 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 6 of 39
18. (load-truck s2 package5 truck3)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   goals met: 6 of 39
19. (drive-truck driver6 s2 s6 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s6)
   goals met: 6 of 39
20. (load-truck s6 package6 truck3)
   deleted: (at package6 s6)
   added: (in package6 truck3)
   goals met: 6 of 39
21. (drive-truck driver6 s6 s0 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   goals met: 6 of 39
22. (unload-truck s0 package5 truck3)
   deleted: (in package5 truck3)
   added: (at package5 s0)
   goals met: 7 of 39
23. (unload-truck s0 package28 truck3)
   deleted: (in package28 truck3)
   added: (at package28 s0)
   goals met: 8 of 39
24. (drive-truck driver6 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 8 of 39
25. (drive-truck driver6 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 8 of 39
26. (unload-truck s5 package3 truck3)
   deleted: (in package3 truck3)
   added: (at package3 s5)
   goals met: 9 of 39
27. (drive-truck driver6 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 9 of 39
28. (load-truck s2 package22 truck3)
   deleted: (at package22 s2)
   added: (in package22 truck3)
   goals met: 9 of 39
29. (load-truck s2 package2 truck3)
   deleted: (at package2 s2)
   added: (in package2 truck3)
   goals met: 9 of 39
30. (drive-truck driver6 s2 s4 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   goals met: 9 of 39
31. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 8 of 39
32. (unload-truck s4 package6 truck3)
   deleted: (in package6 truck3)
   added: (at package6 s4)
   goals met: 9 of 39
33. (load-truck s4 package4 truck3)
   deleted: (at package4 s4)
   added: (in package4 truck3)
   goals met: 9 of 39
34. (unload-truck s4 package31 truck3)
   deleted: (in package31 truck3)
   added: (at package31 s4)
   goals met: 10 of 39
35. (load-truck s4 package27 truck3)
   deleted: (at package27 s4)
   added: (in package27 truck3)
   goals met: 10 of 39
36. (drive-truck driver6 s4 s6 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s6)
   goals met: 10 of 39
37. (drive-truck driver1 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 11 of 39
38. (unload-truck s6 package22 truck3)
   deleted: (in package22 truck3)
   added: (at package22 s6)
   goals met: 12 of 39
39. (load-truck s6 package20 truck3)
   deleted: (at package20 s6)
   added: (in package20 truck3)
   goals met: 12 of 39
40. (drive-truck driver6 s6 s3 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   goals met: 12 of 39
41. (unload-truck s3 package8 truck3)
   deleted: (in package8 truck3)
   added: (at package8 s3)
   goals met: 13 of 39
42. (unload-truck s3 package4 truck3)
   deleted: (in package4 truck3)
   added: (at package4 s3)
   goals met: 14 of 39
43. (drive-truck driver6 s3 s5 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   goals met: 14 of 39
44. (load-truck s5 package11 truck3)
   deleted: (at package11 s5)
   added: (in package11 truck3)
   goals met: 14 of 39
45. (load-truck s5 package10 truck3)
   deleted: (at package10 s5)
   added: (in package10 truck3)
   goals met: 14 of 39
46. (drive-truck driver6 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 14 of 39
47. (load-truck s2 package14 truck3)
   deleted: (at package14 s2)
   added: (in package14 truck3)
   goals met: 14 of 39
48. (load-truck s2 package13 truck3)
   deleted: (at package13 s2)
   added: (in package13 truck3)
   goals met: 14 of 39
49. (drive-truck driver6 s2 s4 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   goals met: 14 of 39
50. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 13 of 39
51. (load-truck s4 package26 truck3)
   deleted: (at package26 s4)
   added: (in package26 truck3)
   goals met: 13 of 39
52. (load-truck s4 package18 truck3)
   deleted: (at package18 s4)
   added: (in package18 truck3)
   goals met: 13 of 39
53. (load-truck s4 package16 truck3)
   deleted: (at package16 s4)
   added: (in package16 truck3)
   goals met: 13 of 39
54. (drive-truck driver6 s4 s1 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s1)
   goals met: 13 of 39
55. (unload-truck s1 package29 truck3)
   deleted: (in package29 truck3)
   added: (at package29 s1)
   goals met: 14 of 39
56. (load-truck s1 package25 truck3)
   deleted: (at package25 s1)
   added: (in package25 truck3)
   goals met: 14 of 39
57. (drive-truck driver6 s1 s4 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s4)
   goals met: 14 of 39
58. (drive-truck driver6 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 14 of 39
59. (unload-truck s5 package25 truck3)
   deleted: (in package25 truck3)
   added: (at package25 s5)
   goals met: 15 of 39
60. (unload-truck s5 package14 truck3)
   deleted: (in package14 truck3)
   added: (at package14 s5)
   goals met: 16 of 39
61. (drive-truck driver6 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 16 of 39
62. (load-truck s4 package12 truck3)
   deleted: (at package12 s4)
   added: (in package12 truck3)
   goals met: 16 of 39
63. (drive-truck driver6 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 16 of 39
64. (drive-truck driver1 s0 s4 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s4)
   goals met: 17 of 39
65. (load-truck s0 package24 truck3)
   deleted: (at package24 s0)
   added: (in package24 truck3)
   goals met: 17 of 39
66. (unload-truck s0 package2 truck3)
   deleted: (in package2 truck3)
   added: (at package2 s0)
   goals met: 18 of 39
67. (drive-truck driver6 s0 s6 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s6)
   goals met: 18 of 39
68. (load-truck s6 package17 truck3)
   deleted: (at package17 s6)
   added: (in package17 truck3)
   goals met: 18 of 39
69. (drive-truck driver6 s6 s3 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   goals met: 18 of 39
70. (unload-truck s3 package27 truck3)
   deleted: (in package27 truck3)
   added: (at package27 s3)
   goals met: 19 of 39
71. (unload-truck s3 package26 truck3)
   deleted: (in package26 truck3)
   added: (at package26 s3)
   goals met: 20 of 39
72. (drive-truck driver6 s3 s2 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s2)
   goals met: 20 of 39
73. (drive-truck driver6 s2 s4 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s4)
   goals met: 20 of 39
74. (unload-truck s4 package11 truck3)
   deleted: (in package11 truck3)
   added: (at package11 s4)
   goals met: 21 of 39
75. (drive-truck driver6 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 21 of 39
76. (load-truck s0 package19 truck3)
   deleted: (at package19 s0)
   added: (in package19 truck3)
   goals met: 21 of 39
77. (drive-truck driver6 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 21 of 39
78. (unload-truck s4 package19 truck3)
   deleted: (in package19 truck3)
   added: (at package19 s4)
   goals met: 22 of 39
79. (board-truck driver3 s1 truck7)
   deleted: (at driver3 s1) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 22 of 39
80. (drive-truck driver3 s1 s0 truck7)
   deleted: (at truck7 s1)
   added: (at truck7 s0)
   goals met: 22 of 39
81. (disembark-truck driver3 s0 truck7)
   deleted: (driving driver3 truck7)
   added: (at driver3 s0) (empty truck7)
   goals met: 23 of 39
82. (board-truck driver2 s4 truck1)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 23 of 39
83. (board-truck driver4 s4 truck2)
   deleted: (at driver4 s4) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 23 of 39
84. (board-truck driver7 s4 truck4)
   deleted: (at driver7 s4) (empty truck4)
   added: (driving driver7 truck4)
   goals met: 23 of 39
85. (drive-truck driver2 s4 s0 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   goals met: 24 of 39
86. (drive-truck driver4 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 24 of 39
87. (drive-truck driver7 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 24 of 39
88. (drive-truck driver6 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 24 of 39
89. (disembark-truck driver1 s4 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s4) (empty truck5)
   goals met: 24 of 39
90. (board-truck driver1 s4 truck6)
   deleted: (at driver1 s4) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 24 of 39
91. (drive-truck driver1 s4 s2 truck6)
   deleted: (at truck6 s4)
   added: (at truck6 s2)
   goals met: 25 of 39
92. (unload-truck s0 package13 truck3)
   deleted: (in package13 truck3)
   added: (at package13 s0)
   goals met: 26 of 39
93. (drive-truck driver6 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 26 of 39
94. (drive-truck driver6 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 26 of 39
95. (drive-truck driver6 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 26 of 39
96. (unload-truck s2 package17 truck3)
   deleted: (in package17 truck3)
   added: (at package17 s2)
   goals met: 27 of 39
97. (drive-truck driver6 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 27 of 39
98. (unload-truck s3 package24 truck3)
   deleted: (in package24 truck3)
   added: (at package24 s3)
   goals met: 28 of 39
99. (drive-truck driver6 s3 s5 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   goals met: 28 of 39
100. (drive-truck driver6 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 28 of 39
101. (unload-truck s1 package18 truck3)
   deleted: (in package18 truck3)
   added: (at package18 s1)
   goals met: 29 of 39
102. (drive-truck driver6 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 29 of 39
103. (unload-truck s0 package12 truck3)
   deleted: (in package12 truck3)
   added: (at package12 s0)
   goals met: 30 of 39
104. (drive-truck driver6 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 30 of 39
105. (drive-truck driver6 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 30 of 39
106. (drive-truck driver6 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 30 of 39
107. (unload-truck s2 package10 truck3)
   deleted: (in package10 truck3)
   added: (at package10 s2)
   goals met: 31 of 39
108. (drive-truck driver6 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 31 of 39
109. (unload-truck s3 package20 truck3)
   deleted: (in package20 truck3)
   added: (at package20 s3)
   goals met: 32 of 39
110. (drive-truck driver6 s3 s5 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s5)
   goals met: 32 of 39
111. (drive-truck driver6 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 32 of 39
112. (unload-truck s1 package16 truck3)
   deleted: (in package16 truck3)
   added: (at package16 s1)
   goals met: 33 of 39
113. (disembark-truck driver4 s5 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s5) (empty truck2)
   goals met: 34 of 39
114. (board-truck driver8 s5 truck2)
   deleted: (at driver8 s5) (empty truck2)
   added: (driving driver8 truck2)
   goals met: 34 of 39
115. (drive-truck driver8 s5 s3 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s3)
   goals met: 35 of 39
116. (disembark-truck driver8 s3 truck2)
   deleted: (driving driver8 truck2)
   added: (at driver8 s3) (empty truck2)
   goals met: 35 of 39
117. (walk driver8 s3 p1-3)
   deleted: (at driver8 s3)
   added: (at driver8 p1-3)
   goals met: 35 of 39
118. (walk driver8 p1-3 s1)
   deleted: (at driver8 p1-3)
   added: (at driver8 s1)
   goals met: 36 of 39
119. (disembark-truck driver6 s1 truck3)
   deleted: (driving driver6 truck3)
   added: (at driver6 s1) (empty truck3)
   goals met: 36 of 39
120. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 35 of 39
121. (disembark-truck driver2 s1 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 36 of 39
122. (disembark-truck driver7 s0 truck4)
   deleted: (driving driver7 truck4)
   added: (at driver7 s0) (empty truck4)
   goals met: 37 of 39
123. (board-truck driver6 s1 truck1)
   deleted: (at driver6 s1) (empty truck1)
   added: (driving driver6 truck1)
   goals met: 37 of 39
124. (drive-truck driver6 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 38 of 39
125. (disembark-truck driver6 s0 truck1)
   deleted: (driving driver6 truck1)
   added: (at driver6 s0) (empty truck1)
   goals met: 38 of 39
126. (board-truck driver6 s0 truck4)
   deleted: (at driver6 s0) (empty truck4)
   added: (driving driver6 truck4)
   goals met: 38 of 39
127. (drive-truck driver6 s0 s6 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s6)
   goals met: 38 of 39
128. (drive-truck driver6 s6 s3 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   goals met: 39 of 39
